{
  "praetorium": {
    "nome": "Praetorium Legislativus",
    "descricao": "O Guardião das Leis e do Processo Legislativo.",
    "imagem": "praetorium.jpg",
    "materias": {
      "Direito Constitucional": {
        "Conceito e Fontes": [
          {
            "id": 1000,
            "texto": "Alguns doutrinadores não fazem distinção entre estado de direito e estado de direito democrático. Outros, porém, afirmam que essa expressão representaria até mesmo uma contradição, já que haveria estados de direito não necessariamente democráticos.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2006 / CL DF"
          },
          {
            "id": 1001,
            "texto": "Embora o Distrito Federal tenha figurado como capital em constituições pretéritas, a Constituição de 1988 estabelece que o DF é a Capital Federal.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2006 / CL DF<br><br><strong>Texto Original Correto:</strong> O DF já figurou como capital da União em constituições anteriores, porém, na atualidade, a capital federal é Brasília.<br><br><strong>Análise do Erro:</strong> Há uma distinção técnica fundamental: Brasília é a Capital Federal (art. 18, § 1º, CF/88), enquanto o Distrito Federal é o ente federativo autônomo onde a capital se situa."
          }
        ],
        "Histórico das Constituições no Brasil": [
          {
            "id": 1002,
            "texto": "A Constituição de 1934 foi a primeira Constituição brasileira a prever a existência dos direitos sociais.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2021 / ALECE"
          },
          {
            "id": 1003,
            "texto": "A Constituição de 1937 inovou ao subordinar, pela primeira vez no constitucionalismo pátrio, o uso da propriedade ao bem-estar social, característica mantida na Carta de 1946.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2006 / CL DF<br><br><strong>Texto Original Correto:</strong> A Constituição de 1937 não tratou da função social da propriedade, mas a carta de 1946 e as reformas constitucionais de 1967 e de 1969 subordinaram o uso da propriedade ao bem-estar social.<br><br><strong>Análise do Erro:</strong> A Carta de 1937 (Polaca) omitiu a função social da propriedade. O erro da questão está em afirmar que ela inovou nesse sentido."
          },
          {
            "id": 1004,
            "texto": "A limitação das tarifas segundo o critério da justa remuneração do capital foi princípio constitucional inscrito nas constituições de 1934, 1937, 1946 e 1969, sendo omitida na Constituição de 1988, o que ensejou nova legislação de concessões baseada na competição.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)"
          },
          {
            "id": 1005,
            "texto": "A Constituição de 1988 determinou que os lagos, rios e quaisquer correntes de água em terrenos de domínio da União são de propriedade exclusiva dos Estados onde se situarem.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / SEN<br><br><strong>Texto Original Correto:</strong> No domínio da União, estão os lagos, os rios e as águas em terrenos de seu domínio, ou que banhem mais de um estado, sirvam de limites com outros países...<br><br><strong>Análise do Erro:</strong> A questão inverteu a titularidade. Águas em terrenos da União ou interestaduais pertencem à União, não aos Estados."
          },
          {
            "id": 1006,
            "texto": "A escassez de recursos externos provocada pela Segunda Guerra Mundial impediu a implantação de modelos alternativos, como as empresas públicas e as companhias de economia mista, para a expansão de serviços essenciais.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)"
          }
        ],
        "Constituição: Conceito, Estrutura, Supremacia e Classificação": [
          {
            "id": 1007,
            "texto": "No que concerne a conteúdo, a constituição que estabelece preceitos cuja matéria não é constitucional classifica-se como formal.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2021 / ALECE"
          },
          {
            "id": 1008,
            "texto": "A constituição promulgada é aquela imposta unilateralmente pelo governante, sem a participação popular direta ou indireta.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2021 / ALECE<br><br><strong>Texto Original Correto:</strong> A constituição promulgada resulta do trabalho de uma assembleia nacional constituinte eleita pelo povo, para, em nome dele, atuar.<br><br><strong>Análise do Erro:</strong> A questão descreveu o conceito de constituição outorgada, não promulgada (democrática)."
          },
          {
            "id": 1009,
            "texto": "A Constituição brasileira é escrita quanto à forma, dogmática quanto ao modo de elaboração, promulgada quanto à origem, rígida quanto à estabilidade e analítica quanto à extensão.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2006 / CL DF"
          },
          {
            "id": 1010,
            "texto": "A Constituição sobrepõe-se a todas as normas jurídicas, exceto aos atos políticos de governo, que não se sujeitam aos limites por ela traçados em virtude da separação dos poderes.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2006 / CL DF<br><br><strong>Texto Original Correto:</strong> A Constituição [...] sobrepõe-se a todas as demais normas jurídicas e aos limites por ela traçados estão todos sujeitos, inclusive os membros do governo.<br><br><strong>Análise do Erro:</strong> Ninguém está acima da Constituição. A supremacia constitucional subordina inclusive os atos de governo."
          },
          {
            "id": 1011,
            "texto": "No sistema jurídico brasileiro, os tratados ou convenções internacionais estão hierarquicamente subordinados à autoridade normativa da Constituição da República.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)"
          },
          {
            "id": 1012,
            "texto": "Em conflito entre norma constitucional e infraconstitucional, deve-se optar necessariamente pela tese da revogação, sendo vedada a declaração de inconstitucionalidade.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> pode-se optar tanto pela tese da simples revogação quanto pela tese da inconstitucionalidade.<br><br><strong>Análise do Erro:</strong> O erro está em restringir as opções hermenêuticas ('deve-se optar necessariamente', 'vedada')."
          },
          {
            "id": 1013,
            "texto": "Como na própria Constituição da República estão previstas as formas pelas quais ela pode ser validamente alterada, é juridicamente correto classificá-la como constituição de tipo rígida.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)"
          }
        ],
        "Dos Princípios Fundamentais da Constituição": [
          {
            "id": 1014,
            "texto": "A Constituição Federal de 1988 define o Brasil como Estado democrático de direito, por conseguinte a vontade dos administradores públicos é circunscrita aos ditames da lei.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2024 / CM Maceió"
          },
          {
            "id": 1015,
            "texto": "Segundo o STF, a livre iniciativa é um princípio absoluto que prevalece sobre a tutela e preservação do meio ambiente, visando o desenvolvimento econômico.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2024 / CM Maceió<br><br><strong>Texto Original Correto:</strong> a livre iniciativa é um meio para atingir os objetivos fundamentais da República, inclusive a tutela e preservação do meio ambiente.<br><br><strong>Análise do Erro:</strong> A livre iniciativa não é absoluta e deve conviver harmonicamente com a preservação ambiental."
          },
          {
            "id": 1016,
            "texto": "A República Federativa do Brasil, constituída como Estado democrático de direito, inclui entre seus fundamentos a cidadania e a dignidade da pessoa humana.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2014 / AL (CAM DEP)"
          },
          {
            "id": 1017,
            "texto": "O princípio jurídico da dignidade da pessoa humana, embora relevante, não orienta os objetivos dos sistemas de direito considerados humanizados, servindo apenas como diretriz ética.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2014 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> O princípio jurídico da dignidade da pessoa humana orienta os objetivos dos sistemas de direito considerados humanizados.<br><br><strong>Análise do Erro:</strong> O princípio possui força normativa e orientadora, não sendo meramente ético."
          },
          {
            "id": 1018,
            "texto": "As relações internacionais da República Federativa do Brasil regem-se pelo princípio da autodeterminação dos povos.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2012 / TL (CAM DEP)"
          },
          {
            "id": 1019,
            "texto": "Os princípios que regem o Brasil nas suas relações internacionais incluem a cooperação entre os povos e a vedação à concessão de asilo político, salvo em casos de reciprocidade.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2012 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> Os princípios [...] incluem [...] a concessão de asilo político.<br><br><strong>Análise do Erro:</strong> A concessão de asilo político é um princípio expresso (art. 4º, X), e não uma vedação."
          },
          {
            "id": 1020,
            "texto": "Entre os fundamentos do Estado Democrático de Direito consagrados pela Carta de 1988 estão a soberania, a dignidade da pessoa humana e o pluralismo político.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)"
          },
          {
            "id": 1021,
            "texto": "A prevalência dos direitos humanos é um princípio que rege o Brasil em suas relações internas, não se aplicando à sua ação em termos de relações internacionais devido à soberania dos outros países.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> A prevalência dos direitos humanos é um dos componentes essenciais na ação do Brasil em termos de relações internacionais.<br><br><strong>Análise do Erro:</strong> A prevalência dos direitos humanos é princípio expresso nas relações internacionais (art. 4º, II)."
          },
          {
            "id": 1022,
            "texto": "Em suas relações internacionais, o Brasil deve orientar-se por princípios que fortaleçam os direitos humanos, devendo repudiar o terrorismo e o racismo.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / SEN"
          }
        ],
        "Dos Direitos e Deveres Individuais e Coletivos": [
          {
            "id": 1023,
            "texto": "O texto constitucional garante o livre exercício de todo e qualquer trabalho, não havendo óbice para que a lei estabeleça requisitos para o exercício de determinadas profissões.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2024 / CM Maceió"
          },
          {
            "id": 1024,
            "texto": "Se lei ordinária revogar a regra que previa a incorporação de vantagem pessoal ao patrimônio de servidor público, tal lei será considerada constitucional, pois não há direito adquirido a regime jurídico.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2014 / TL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> tal lei, nesse caso, será inconstitucional (em virtude do direito adquirido).<br><br><strong>Análise do Erro:</strong> Embora não haja direito adquirido a regime jurídico, se a vantagem já foi licitamente incorporada (ato jurídico perfeito/direito adquirido), a lei revogadora não pode atingir o passado."
          },
          {
            "id": 1025,
            "texto": "No âmbito judicial e administrativo, a todos são assegurados a razoável duração do processo e os meios que garantam a celeridade de sua tramitação.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2014 / AL (CAM DEP)"
          },
          {
            "id": 1026,
            "texto": "Na esfera judicial, é indispensável a prévia oitiva do investigado para que seja quebrado seu sigilo bancário, sob pena de nulidade absoluta da prova.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2011 / ALES<br><br><strong>Texto Original Correto:</strong> é dispensável a prévia oitiva do investigado para que seja quebrado seu sigilo bancário.<br><br><strong>Análise do Erro:</strong> A quebra de sigilo muitas vezes requer surpresa para ser eficaz, sendo dispensável a oitiva prévia."
          },
          {
            "id": 1027,
            "texto": "Um projeto de lei que obriga o deficiente visual a apresentar comprovante de registro em associação específica para garantir o acesso de cão-guia é materialmente inconstitucional, pois ninguém é obrigado a associar-se.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2006 / CL DF"
          },
          {
            "id": 1028,
            "texto": "A inviolabilidade do domicílio é absoluta, não se admitindo o ingresso da autoridade pública sem consentimento do morador, nem mesmo em caso de flagrante delito à noite.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2006 / CL DF<br><br><strong>Texto Original Correto:</strong> mesmo à noite, no caso de flagrante delito, admite-se o ingresso no domicílio contra a vontade do ocupante.<br><br><strong>Análise do Erro:</strong> O flagrante delito é uma das exceções constitucionais que permitem o ingresso a qualquer hora, independentemente de consentimento."
          },
          {
            "id": 1029,
            "texto": "Qualquer pessoa pode exigir dos órgãos públicos informações que sejam do seu interesse particular, mas as informações sigilosas imprescindíveis à segurança do Estado podem ser negadas.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2006 / CL DF"
          },
          {
            "id": 1030,
            "texto": "O registro civil de nascimento é gratuito aos reconhecidamente pobres, contudo, a certidão de óbito depende de pagamento de emolumentos para todos os cidadãos, sem exceção.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2006 / CL DF<br><br><strong>Texto Original Correto:</strong> O registro civil de nascimento e a certidão de óbito [...] são de obtenção gratuita aos reconhecidamente pobres.<br><br><strong>Análise do Erro:</strong> A gratuidade constitucional abrange tanto o nascimento quanto o óbito para os pobres."
          },
          {
            "id": 1031,
            "texto": "Além da indenização por dano material, moral ou à imagem, é assegurado o direito de resposta, proporcional ao agravo.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)"
          },
          {
            "id": 1032,
            "texto": "A pena não pode passar da pessoa do condenado, razão pela qual a obrigação de reparar o dano e a decretação do perdimento de bens extinguem-se automaticamente com a morte do autor, não podendo atingir os sucessores.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> a obrigação de reparar o dano e a decretação do perdimento de bens podem estender-se aos sucessores até o limite do valor do patrimônio transferido.<br><br><strong>Análise do Erro:</strong> A intranscendência da pena aplica-se à sanção corporal, mas os efeitos patrimoniais podem atingir os sucessores até o limite da herança."
          },
          {
            "id": 1033,
            "texto": "O direito adquirido compõe o rol das cláusulas pétreas, não podendo, portanto, ser prejudicado ou violado.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)"
          },
          {
            "id": 1034,
            "texto": "O princípio constitucional segundo o qual todos são iguais perante a lei impede, de forma absoluta, qualquer possibilidade de tratamento diferenciado entre homens e mulheres.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> O princípio constitucional [...] não exclui a possibilidade do tratamento diferenciado.<br><br><strong>Análise do Erro:</strong> O princípio da igualdade material permite discriminações positivas para equiparar desiguais (ex: licença-maternidade, aposentadoria, Lei Maria da Penha)."
          }
        ],
"Direitos Sociais e dos Trabalhadores": [
          {
            "id": 2000,
            "texto": "A jornada de seis horas para o trabalho realizado em turnos ininterruptos de revezamento poderá ser aumentada ou reduzida mediante negociação coletiva.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2014 / AL (CAM DEP)"
          },
          {
            "id": 2001,
            "texto": "Os brasileiros que trabalham como empregados domésticos em embaixadas estrangeiras localizadas no Brasil têm seus contratos regidos pela legislação do país representado pela embaixada, devido à extraterritorialidade, sendo incompetente a Justiça do Trabalho brasileira.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> têm seus contratos de trabalho regidos pela legislação trabalhista brasileira, sendo a solução de eventuais litígios [...] competência da Justiça do Trabalho brasileira.<br><br><strong>Análise do Erro:</strong> A imunidade de jurisdição não é absoluta em matéria trabalhista. A legislação aplicável é a brasileira (lex loci executionis)."
          },
          {
            "id": 2002,
            "texto": "Seria inconstitucional uma lei que determinasse que, no serviço público, a remuneração do serviço extraordinário fosse apenas 30% superior à do serviço normal.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2003 / AL (CAM DEP)"
          }
        ],
        "Direitos Coletivos dos Trabalhadores": [
          {
            "id": 2003,
            "texto": "As negociações coletivas de trabalho podem prescindir da participação dos sindicatos caso haja comissão de trabalhadores eleita para esse fim específico na empresa.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2012 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> As negociações coletivas de trabalho devem contar obrigatoriamente com a participação dos sindicatos.<br><br><strong>Análise do Erro:</strong> A Constituição (art. 8º, VI) torna obrigatória a participação dos sindicatos nas negociações coletivas de trabalho."
          },
          {
            "id": 2004,
            "texto": "A criação de sindicatos independe de autorização estatal, ressalvado o registro no órgão competente, sendo vedado ao sindicato que represente a mesma categoria profissional abranger a mesma base territorial de outro.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2014 / AL (CAM DEP)"
          }
        ],
        "Nacionalidade e Extradição": [
          {
            "id": 2005,
            "texto": "A Constituição assegura a igualdade de direitos entre brasileiros natos e naturalizados, mas estabelece limitações a essa isonomia, entre as quais a impossibilidade de ocupação de cargo de Ministro do Tribunal Superior Eleitoral proveniente de vaga destinada a Ministro do STF.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2014 / AL (CAM DEP)"
          },
          {
            "id": 2006,
            "texto": "O cargo de oficial das Forças Armadas é privativo de brasileiro nato, contudo, a Constituição permite que brasileiros naturalizados ocupem o posto de Tenente do Exército, restringindo apenas o oficialato general.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2012 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> O cargo de tenente do Exército somente pode ser ocupado por brasileiro nato.<br><br><strong>Análise do Erro:</strong> A carreira de oficial das Forças Armadas (incluindo Tenente) é privativa de brasileiro nato (art. 12, § 3º)."
          },
          {
            "id": 2007,
            "texto": "João, brasileiro nato, cometeu crime no exterior e regressou ao Brasil. Nessa situação, o Brasil não concederá a extradição de João, independentemente da natureza do delito.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2014 / AL (CAM DEP)"
          },
          {
            "id": 2008,
            "texto": "A atual Constituição Federal veda, de forma absoluta, a perda da nacionalidade de brasileiro nato, mesmo nos casos em que este adquira voluntariamente outra nacionalidade.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> A atual Constituição da República admite que brasileiro nato possa perder a nacionalidade brasileira (em casos de aquisição de outra nacionalidade, salvo exceções).<br><br><strong>Análise do Erro:</strong> Brasileiro nato pode perder a nacionalidade se adquirir outra voluntariamente, salvo nas exceções de reconhecimento originário ou imposição para permanência/exercício de direitos civis."
          }
        ],
        "Direitos Políticos e Partidos": [
          {
            "id": 2009,
            "texto": "Os policiais militares, em qualquer nível da carreira, são alistáveis.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2011 / ALES"
          },
          {
            "id": 2010,
            "texto": "Enquanto a idade mínima exigida para candidatos a presidente da República é trinta e cinco anos, para os candidatos a deputado federal a exigência é de dezoito anos.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> para os candidatos a deputados essa exigência cai para vinte e um anos.<br><br><strong>Análise do Erro:</strong> A idade mínima para Deputado (Federal ou Estadual) é 21 anos. 18 anos é apenas para Vereador."
          },
          {
            "id": 2011,
            "texto": "Os analfabetos são inelegíveis, mas podem alistar-se e votar.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / SEN"
          },
          {
            "id": 2012,
            "texto": "O cidadão pode ter seus direitos políticos cassados em virtude de condenação em ação por abuso de poder econômico-eleitoral transitada em julgado.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2021 / ALECE<br><br><strong>Texto Original Correto:</strong> A CF veda a cassação desses direitos e só admite a perda ou a suspensão.<br><br><strong>Análise do Erro:</strong> A Constituição veda expressamente a cassação (art. 15). O caso descrito gera suspensão/perda, nunca cassação."
          },
          {
            "id": 2013,
            "texto": "A Constituição da República define os partidos políticos como pessoas jurídicas de direito público, devendo seus estatutos ser aprovados pelo Congresso Nacional.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / SEN<br><br><strong>Texto Original Correto:</strong> definidos [...] como pessoa jurídica de direito privado, devendo esses [...] registrar seus estatutos no TSE.<br><br><strong>Análise do Erro:</strong> Partidos são pessoas jurídicas de direito privado e registram estatutos no TSE, não no Congresso."
          },
          {
            "id": 2014,
            "texto": "A utilização de organizações paramilitares pelos partidos é expressamente vedada pelo texto constitucional.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2021 / ALECE"
          }
        ],
"Da Organização Político-Administrativa": [
          {
            "id": 3000,
            "texto": "A República Federativa do Brasil organiza-se política e administrativamente em estados, municípios, Distrito Federal e União, que se aliam em união indissolúvel para a formação de um Estado Federal ou Federação.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2021 / ALECE"
          },
          {
            "id": 3001,
            "texto": "A vedação constitucional à secessão é relativa, permitindo que os estados-membros se separem da Federação caso realizem plebiscito local com aprovação da maioria absoluta da população.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> A vedação constitucional à secessão impede que os estados-membros se separem da Federação, sob pena de intervenção federal.<br><br><strong>Análise do Erro:</strong> O princípio da indissolubilidade do vínculo federativo é absoluto, não existindo direito de secessão no Brasil."
          }
        ],
        "União: Bens e Competências": [
          {
            "id": 3002,
            "texto": "É competência comum da União, dos estados, do Distrito Federal e dos municípios fomentar a produção agropecuária.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2021 / ALECE"
          },
          {
            "id": 3003,
            "texto": "Os estados possuem competência plena e originária para legislar sobre navegação lacustre e fluvial, independentemente de autorização federal, por se tratar de águas internas.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2021 / ALECE<br><br><strong>Texto Original Correto:</strong> O estado pode legislar sobre navegação lacustre e fluvial, desde que lei complementar específica o autorize.<br><br><strong>Análise do Erro:</strong> A competência privativa é da União (art. 22, X), podendo ser delegada aos Estados somente mediante Lei Complementar."
          },
          {
            "id": 3004,
            "texto": "Compete à União organizar e manter a Polícia Civil, a Polícia Militar e o Corpo de Bombeiros Militar do Distrito Federal.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2006 / CL DF"
          },
          {
            "id": 3005,
            "texto": "A competência para legislar sobre trânsito e transporte é comum a todos os entes federados, permitindo que estados e municípios fixem limites de velocidade em rodovias federais.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> competir privativamente à União legislar sobre trânsito.<br><br><strong>Análise do Erro:</strong> Legislar sobre trânsito e transporte é competência privativa da União (art. 22, XI). Municípios legislam apenas sobre interesse local (circulação urbana)."
          }
        ],
        "Estados Federados": [
          {
            "id": 3006,
            "texto": "Incorreria em inconstitucionalidade lei distrital que reservasse para mulheres metade das vagas abertas nos concursos públicos para oficial do Corpo de Bombeiros Militar do DF.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2006 / CL DF"
          },
          {
            "id": 3007,
            "texto": "É constitucional dispositivo de Constituição estadual que exija prévia licença da assembleia legislativa para qualquer ausência do governador do país, independentemente do prazo de duração da viagem.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2014 / TL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> Afrontaria a CF dispositivo de Constituição estadual que previsse que a ausência do país do governador e do vice-governador, por qualquer prazo, dependeria de prévia licença da assembleia legislativa.<br><br><strong>Análise do Erro:</strong> A exigência de licença para qualquer prazo viola o princípio da separação dos poderes. A CF estabelece o prazo superior a 15 dias (simetria)."
          }
        ],
        "Municípios": [
          {
            "id": 3008,
            "texto": "A fixação do subsídio dos vereadores cabe à câmara municipal, que deve fixá-lo, em cada legislatura, para a legislatura subsequente.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2014 / AL (CAM DEP)"
          },
          {
            "id": 3009,
            "texto": "A inviolabilidade do vereador por suas opiniões, palavras e votos proferidos no exercício do mandato estende-se a todo o território estadual, garantindo ampla liberdade de expressão.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2021 / ALECE<br><br><strong>Texto Original Correto:</strong> A inviolabilidade do vereador [...] possui abrangência restrita a seu respectivo município.<br><br><strong>Análise do Erro:</strong> A imunidade material do vereador é limitada à circunscrição do município (art. 29, VIII)."
          },
          {
            "id": 3010,
            "texto": "Cabe aos municípios prestar os serviços de coleta de resíduos sólidos e de fornecimento de água, bem como quaisquer serviços de interesse local que não sejam de competência exclusiva de outro ente da Federação.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2024 / CM Maceió"
          },
          {
            "id": 3011,
            "texto": "A Constituição Federal veda aos municípios a instituição e arrecadação de tributos próprios, cabendo tal competência apenas à União e aos Estados.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> A Constituição da República permite que os municípios instituam e arrecadem tributos de sua competência.<br><br><strong>Análise do Erro:</strong> Os municípios possuem competência tributária própria (IPTU, ISS, ITBI)."
          }
        ],
        "Distrito Federal e Territórios": [
          {
            "id": 3012,
            "texto": "Como o DF detém competência legislativa residual em relação à União, toda competência legislativa que não for vedada ao DF a ele estará reservada.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2006 / CL DF"
          },
          {
            "id": 3013,
            "texto": "A União jamais poderá intervir no Distrito Federal, visto que este possui autonomia política absoluta equiparada à da União.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2006 / CL DF<br><br><strong>Texto Original Correto:</strong> A União pode intervir no DF para reorganizar suas finanças, caso o DF, injustificadamente, suspenda o pagamento da sua dívida fundada por mais de dois anos consecutivos.<br><br><strong>Análise do Erro:</strong> O DF é passível de Intervenção Federal (art. 34)."
          }
        ],
        "Intervenção Federal": [
          {
            "id": 3014,
            "texto": "A intervenção federal pode ser decretada para garantir o livre exercício do Poder Judiciário nas unidades da Federação, hipótese em que é demandada requisição do Supremo Tribunal Federal.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2024 / CM Maceió"
          },
          {
            "id": 3015,
            "texto": "Quando o STF julga procedente a ação direta de inconstitucionalidade interventiva, o presidente da República mantém a discricionariedade política para decidir se decreta ou não a intervenção.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2011 / ALES<br><br><strong>Texto Original Correto:</strong> o presidente da República tem a obrigação de decretar a intervenção no ente federado, não lhe restando margem de discricionariedade.<br><br><strong>Análise do Erro:</strong> No caso de requisição judicial ou ADI interventiva, o ato é vinculado, não discricionário."
          }
        ],
        "Administração Pública e Servidores": [
          {
            "id": 3016,
            "texto": "Os vencimentos dos cargos do Poder Judiciário não podem ultrapassar os pagos pelo Poder Executivo.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2024 / CM Maceió"
          },
          {
            "id": 3017,
            "texto": "A Constituição determina que as administrações tributárias da União e do DF atuem de forma isolada e independente, sendo vedado o compartilhamento de cadastros fiscais para preservar o sigilo.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2006 / CL DF<br><br><strong>Texto Original Correto:</strong> as administrações tributárias [...] devem atuar de forma integrada, inclusive com o compartilhamento de cadastros e de informações fiscais.<br><br><strong>Análise do Erro:</strong> O art. 37, XXII, determina a atuação integrada e o compartilhamento de dados."
          },
          {
            "id": 3018,
            "texto": "A remuneração dos servidores públicos organizados em carreira pode ser fixada por meio de subsídio.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2024 / CM Maceió"
          },
          {
            "id": 3019,
            "texto": "A Constituição Federal veda, de forma absoluta, a acumulação remunerada de dois cargos públicos de professor, ainda que haja compatibilidade de horários.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> É vedada a acumulação [...] exceto, quando houver compatibilidade de horários, a de dois cargos de professor...<br><br><strong>Análise do Erro:</strong> A acumulação de dois cargos de professor é uma das exceções constitucionais permitidas (art. 37, XVI)."
          }
        ],
"Poder Legislativo (Estrutura e Atribuições)": [
          {
            "id": 4000,
            "texto": "Via de regra, em cada Casa do Congresso Nacional, assim como nas suas comissões, estando presente a maioria absoluta de seus membros, as deliberações serão tomadas por maioria dos votos.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2012 / AL (CAM DEP)"
          },
          {
            "id": 4001,
            "texto": "O Poder Legislativo brasileiro restringe-se, por força do princípio da separação dos poderes, à atividade estrita de produção de normas jurídicas, sendo vedado o exercício de atividades de fiscalização ou julgamento, típicas dos outros poderes.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> O Poder Legislativo brasileiro não se restringe à atividade estrita de produção de normas jurídicas, uma vez que possui também atividades de fiscalização, de investigação e até de julgamento...<br><br><strong>Análise do Erro:</strong> O Legislativo exerce funções típicas (legislativa e fiscalizatória) e atípicas (julgamento e administração), não se restringindo apenas à produção de leis."
          },
          {
            "id": 4002,
            "texto": "É da competência exclusiva do Congresso Nacional autorizar a exploração e o aproveitamento de recursos hídricos e a pesquisa e lavra de riquezas minerais em terras indígenas.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2012 / AL (CAM DEP)"
          },
          {
            "id": 4003,
            "texto": "Compete privativamente ao Supremo Tribunal Federal sustar os atos normativos do Poder Executivo que exorbitem do poder regulamentar ou dos limites de delegação legislativa, em virtude do controle de constitucionalidade.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> Compete exclusivamente ao Congresso Nacional sustar os atos normativos do Poder Executivo que exorbitem do poder regulamentar...<br><br><strong>Análise do Erro:</strong> A sustação de atos que exorbitam o poder regulamentar é competência exclusiva do Congresso Nacional (controle político/legislativo), não do STF (controle jurisdicional)."
          },
          {
            "id": 4004,
            "texto": "Depende de prévia autorização da Câmara dos Deputados, por dois terços de seus membros, a instauração de processo contra o presidente e o vice-presidente da República, bem como contra ministros de Estado.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2012 / AL (CAM DEP)"
          },
          {
            "id": 4005,
            "texto": "Para que um estado federado possa contrair empréstimo frente a um banco privado internacional, é necessária a aprovação da Câmara dos Deputados, órgão representante do povo.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / SEN<br><br><strong>Texto Original Correto:</strong> é necessário aprovação do Senado Federal.<br><br><strong>Análise do Erro:</strong> O Senado Federal é a casa que representa os Estados e o DF, sendo competente para autorizar operações externas de natureza financeira (art. 52, V)."
          },
          {
            "id": 4006,
            "texto": "Os deputados e os senadores gozam de imunidade material, sendo invioláveis civil e penalmente por opiniões, palavras e votos proferidos no exercício do mandato.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2012 / AL (CAM DEP)"
          },
          {
            "id": 4007,
            "texto": "Não há impedimento constitucional para que deputado federal aceite cargo ou função em empresa concessionária de serviço público, desde que ele seja sócio da empresa e se licencie do mandato.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2014 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> É vedado ao deputado federal aceitar cargo ou função em empresa concessionária de serviço público, ainda que ele seja sócio da empresa.<br><br><strong>Análise do Erro:</strong> A vedação constitucional (art. 54, I, 'a') é ampla e visa evitar conflito de interesses, proibindo a aceitação de cargo em concessionárias controladas pelo poder público."
          }
        ],
        "Processo Legislativo": [
          {
            "id": 4008,
            "texto": "A proposta de emenda constitucional tendente a abolir os direitos e as garantias fundamentais não poderá ser objeto de deliberação pelo Poder Legislativo.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2011 / ALES"
          },
          {
            "id": 4009,
            "texto": "A CF determina que a votação de medidas provisórias se inicie na Câmara dos Deputados, cabendo à comissão mista emitir parecer prévio.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2012 / AL (CAM DEP)"
          },
          {
            "id": 4010,
            "texto": "Se uma medida provisória não for apreciada em até 45 dias, contados de sua publicação, ela perde a eficácia imediatamente, devendo o Congresso Nacional disciplinar as relações jurídicas dela decorrentes.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> Se uma MP não for apreciada em até 45 dias, [...] ficarão sobrestadas, até que se conclua a votação da MP, todas as demais deliberações legislativas...<br><br><strong>Análise do Erro:</strong> Após 45 dias, a MP entra em regime de urgência (tranca a pauta), mas não perde a eficácia imediatamente. A perda de eficácia ocorre após 60 dias (prorrogáveis por mais 60)."
          },
          {
            "id": 4011,
            "texto": "Nem todos os assuntos podem ser objeto de lei delegada, como, por exemplo, a matéria relativa à legislação sobre planos plurianuais, diretrizes orçamentárias e orçamentos.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2014 / AL (CAM DEP)"
          },
          {
            "id": 4012,
            "texto": "É de competência concorrente entre o Presidente da República e os Governadores a iniciativa de leis que disponham sobre normas gerais para a organização do Ministério Público e da Defensoria Pública dos estados.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2012 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> São de iniciativa privativa do presidente da República as leis que disponham sobre normas gerais...<br><br><strong>Análise do Erro:</strong> A iniciativa para normas gerais nacionais é privativa do Presidente da República (art. 61, § 1º, II, 'd')."
          }
        ],
        "Forças Armadas e Segurança Pública": [
          {
            "id": 4013,
            "texto": "O militar da ativa que tomar posse em cargo ou emprego público civil permanente será transferido para a reserva, nos termos da lei.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)"
          },
          {
            "id": 4014,
            "texto": "Os comandantes da Marinha, do Exército e da Aeronáutica subordinam-se ao Ministério da Defesa, não possuindo status de Ministros de Estado.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / SEN<br><br><strong>Texto Original Correto:</strong> Os comandantes da Marinha, do Exército e da Aeronáutica possuem status de ministros de Estado.<br><br><strong>Análise do Erro:</strong> Embora subordinados ao Presidente, os Comandantes das Forças possuem prerrogativas e status de Ministro."
          },
          {
            "id": 4015,
            "texto": "A Constituição Federal estabelece, taxativamente, os órgãos componentes do aparato estatal de segurança pública, vedando a ampliação desse rol pelas constituições estaduais.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2006 / CL DF"
          },
          {
            "id": 4016,
            "texto": "A Constituição da República conferiu aos municípios a possibilidade de constituição de guardas municipais com atribuição de policiamento ostensivo e preservação da ordem pública, equiparando-as às polícias militares.",
            "gabarito": "Errado",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)<br><br><strong>Texto Original Correto:</strong> guardas municipais destinadas tão-somente à proteção de seus bens, serviços e instalações.<br><br><strong>Análise do Erro:</strong> A competência constitucional originária das Guardas (art. 144, § 8º) é a proteção de bens, serviços e instalações, embora o STF tenha ampliado recentemente o entendimento sobre sua atuação na segurança, o texto constitucional literal as distingue das Polícias Militares (ostensivas)."
          },
          {
            "id": 4017,
            "texto": "Cabe às polícias civis, dirigidas por delegados de polícia de carreira, realizar o papel de polícia judiciária e a apuração de infrações penais, exceto as militares.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> CEBRASPE (CESPE) / 2002 / AL (CAM DEP)"
          }
        ]
      }
    }
  },
  "enam_criscis": {
    "nome": "Enam Criscis",
    "descricao": "A Sabedoria da Toga. Mestre do Exame Nacional da Magistratura.",
    "imagem": "enam-criscis.png",
    "materias": {
      "Direitos Humanos": {
        "Geral": [
          {
            "id": 401,
            "texto": "A Corte Interamericana de Direitos Humanos admite a possibilidade de controle de convencionalidade das leis internas.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> Jurisprudência Corte IDH"
          }
        ]
      }
    }
  },
  "parquet_tribunus": {
    "nome": "Parquet Tribunus",
    "descricao": "O Defensor da Sociedade. Mestre das Promotorias de Justiça.",
    "imagem": "parquet.jpg",
    "materias": {
      "Direito Processual Coletivo": {
        "Ação Civil Pública": [
          {
            "id": 501,
            "texto": "O Ministério Público possui legitimidade para propor Ação Civil Pública visando a defesa de direitos individuais homogêneos, ainda que disponíveis, quando houver relevância social.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> Tema Repetitivo STJ"
          }
        ]
      }
    }
  },
  "noel_autarquicus": {
    "nome": "Noel Autarquicus",
    "descricao": "O Guardião dos Municípios e Conselhos. Mestre da Administração Local.",
    "imagem": "noel.png",
    "materias": {
      "Direito Administrativo": {
        "Servidores Públicos": [
          {
            "id": 601,
            "texto": "É constitucional a exigência de inscrição em conselho de fiscalização profissional para o exercício de cargos públicos cujas funções exijam qualificação técnica específica.",
            "gabarito": "Certo",
            "explicacao": "<strong>Metadados:</strong> Tema 999 STF"
          }
        ]
      }
    }
  }
}